Repository: WoodbutcherTh1/HoursTracker
Catalog: HoursTracker/Resources/Localizable.xcstrings
Source language: en
Languages: ar, he, ru

source: Ask HoursTracker
ar: اسأل HoursTracker
he: שאלו את HoursTracker
ru: Спросить HoursTracker

source: Ask about your hours, overtime, pay or payslips.
ar: اسأل عن ساعاتك، الإضافي، الأجر أو قسائم الراتب.
he: שאלו על השעות, השעות הנוספות, השכר או התלושים.
ru: Спросите о часах, сверхурочных, оплате или расчётных листах.

source: Back to work after your break.
ar: ارجع للشغل بعد الاستراحة.
he: חזרה לעבודה אחרי ההפסקה.
ru: Вернитесь к работе после перерыва.

source: Clock in and start tracking your shift.
ar: سجّل دخول وابدأ تتبّع ورديتك.
he: רישום כניסה ותחילת מעקב אחרי המשמרת.
ru: Начните смену и отслеживание времени.

source: Clock out and hear how your shift went.
ar: سجّل خروج واسمع ملخص ورديتك.
he: רישום יציאה ושמיעת סיכום המשמרת.
ru: Завершите смену и услышьте её итоги.

# Create a hours report file you can share or save.
source: Create an hours report file you can share or save.
ar: إنشاء ملف تقرير ساعات للمشاركة أو الحفظ.
he: יצירת קובץ דוח שעות לשיתוף או לשמירה.
ru: Создайте файл отчёта о часах, чтобы поделиться или сохранить.

source: End Break
ar: إنهاء الاستراحة
he: חזרה מהפסקה
ru: Закончить перерыв

source: End Shift
ar: إنهاء الوردية
he: סיום משמרת
ru: Закончить смену

source: Export ${period} as ${format}
ar: تصدير ${period} بصيغة ${format}
he: ייצוא ${period} כ־${format}
ru: Экспорт: ${period}, ${format}

source: Export Report
ar: تصدير تقرير
he: ייצוא דוח
ru: Экспорт отчёта

source: Format
ar: الصيغة
he: פורמט
ru: Формат

source: Hear whether you're clocked in, for how long, and what you've earned so far.
ar: هل إنت بالشغل، من قديش، وقديش طلعت لهلأ.
he: האם אתם במשמרת, כמה זמן, וכמה הרווחתם עד עכשיו.
ru: На смене ли вы, сколько времени и сколько уже заработали.

source: Hear your hours and estimated pay for today, this week or a month.
ar: ساعاتك وأجرك التقريبي لليوم أو الأسبوع أو الشهر.
he: השעות וההכנסה המשוערת להיום, לשבוע או לחודש.
ru: Часы и примерный заработок за день, неделю или месяц.

source: Hours and Earnings
ar: الساعات والأجر
he: שעות והכנסה
ru: Часы и заработок

source: Hours and earnings for ${period}
ar: الساعات والأجر لـ ${period}
he: שעות והכנסה ל${period}
ru: Часы и заработок: ${period}

source: Last Month
ar: الشهر الماضي
he: החודש שעבר
ru: Прошлый месяц

source: Pause your shift for a break.
ar: أوقف الوردية مؤقتاً للاستراحة.
he: השהיית המשמרת להפסקה.
ru: Приостановите смену на перерыв.

source: Period
ar: الفترة
he: תקופה
ru: Период

source: Question
ar: السؤال
he: שאלה
ru: Вопрос

source: Shift Status
ar: حالة الوردية
he: מצב המשמרת
ru: Статус смены

source: Start Break
ar: بدء استراحة
he: יציאה להפסקה
ru: Начать перерыв

source: Start Shift
ar: بدء الوردية
he: התחלת משמרת
ru: Начать смену

source: This Month
ar: هالشهر
he: החודש
ru: Этот месяц

source: This Week
ar: هالأسبوع
he: השבוע
ru: Эта неделя

source: Today
ar: اليوم
he: היום
ru: Сегодня

source: What would you like to know?
ar: شو بدك تعرف؟
he: מה תרצו לדעת?
ru: Что вы хотите узнать?

# about.madeIn
source: Made with ❤️ in Israel
ar: صُنع بحبّ ❤️ في إسرائيل
he: נעשה באהבה ❤️ בישראל
ru: Сделано с ❤️ в Израиле

# about.rateThanks
source: Thanks for wanting to rate us!
ar: شكرًا لرغبتك في تقييمنا!
he: תודה שרציתם לדרג אותנו!
ru: Спасибо, что хотите нас оценить!

# account.alreadyHaveAccount
source: Already have an account? Sign In
ar: لديك حساب بالفعل؟ تسجيل الدخول
he: כבר יש לכם חשבון? התחברות
ru: Уже есть аккаунт? Войти

# account.avatarChange
source: Change Photo
ar: تغيير الصورة
he: החלפת תמונה
ru: Изменить фото

# account.avatarRemove
source: Remove Photo
ar: إزالة الصورة
he: הסרת תמונה
ru: Удалить фото

# account.backToSignIn
source: Back to Sign In
ar: العودة لتسجيل الدخول
he: חזרה להתחברות
ru: Назад ко входу

# account.changePassword
source: Update Password
ar: تحديث كلمة المرور
he: עדכון סיסמה
ru: Сменить пароль

# account.checkSpamHint
source: Didn't get the code? Check your Spam / Junk folder.
ar: ما وصلك الكود؟ شيك على مجلد الـSpam / الرسائل غير المرغوبة.
he: לא קיבלת את הקוד? כדאי לבדוק בתיקיית הספאם.
ru: Не пришёл код? Проверьте папку «Спам».

# account.codePlaceholder
source: 8-digit code
ar: رمز من 8 أرقام
he: קוד בן 8 ספרות
ru: 8-значный код

# account.confirmPassword
source: Confirm Password
ar: تأكيد كلمة المرور
he: אימות סיסמה
ru: Повторите пароль

# account.createButton
source: Create Account
ar: إنشاء حساب
he: צור חשבון
ru: Создать аккаунт

# account.dataSection
source: Data
ar: البيانات
he: נתונים
ru: Данные

# account.delete
source: Delete account
ar: حذف الحساب
he: מחיקת החשבון
ru: Удалить аккаунт

# account.delete.confirmMessage
source: Your account and its backup on our server will be deleted for good. Shifts on this iPhone stay. This cannot be undone.
ar: سيُحذف حسابك ونسخته الاحتياطية على خادمنا نهائيًا. الورديات على هذا الآيفون تبقى. لا يمكن التراجع عن ذلك.
he: החשבון והגיבוי שלו בשרת שלנו יימחקו לצמיתות. המשמרות באייפון הזה יישארו. אי אפשר לבטל את הפעולה.
ru: Аккаунт и его копия на нашем сервере будут удалены навсегда. Смены на этом iPhone останутся. Это нельзя отменить.

# account.delete.confirmTitle
source: Delete your account?
ar: حذف حسابك؟
he: למחוק את החשבון?
ru: Удалить аккаунт?

# account.delete.done
source: Account deleted
ar: تم حذف الحساب
he: החשבון נמחק
ru: Аккаунт удалён

# account.delete.failed
source: The account could not be deleted. Check your connection and try again.
ar: تعذّر حذف الحساب. تحقّق من الاتصال وحاول مرة أخرى.
he: לא ניתן היה למחוק את החשבון. בדקו את החיבור ונסו שוב.
ru: Не удалось удалить аккаунт. Проверьте подключение и попробуйте снова.

# account.emailPlaceholder
source: Email
ar: البريد الإلكتروني
he: אימייל
ru: Эл. почта

# account.error.codeExpired
source: That code is incorrect or has expired. Check the most recent email, or request a new one.
ar: هذا الرمز غير صحيح أو منتهي الصلاحية. تحقّق من أحدث بريد إلكتروني، أو اطلب رمزاً جديداً.
he: הקוד שגוי או שפג תוקפו. בדקו את המייל האחרון, או בקשו קוד חדש.
ru: Код неверный или устарел. Проверьте последнее письмо или запросите новый код.

# account.error.codeIncomplete
source: Enter the full 8-digit code.
ar: أدخل الرمز الكامل المكوّن من 8 أرقام.
he: הזינו את הקוד המלא בן 8 הספרות.
ru: Введите все 8 цифр кода.

# account.error.invalidEmail
source: Please enter a valid email address.
ar: الرجاء إدخال بريد إلكتروني صحيح.
he: נא להזין כתובת אימייל תקינה.
ru: Введите правильный адрес эл. почты.

# account.error.nameRequired
source: Please enter your name.
ar: الرجاء إدخال اسمك.
he: נא להזין שם.
ru: Введите своё имя.

# account.error.notSignedUpYet
source: You need to sign in first.
ar: يجب عليك تسجيل الدخول أولاً.
he: עליכם להתחבר קודם.
ru: Сначала войдите в аккаунт.

# account.error.passwordTooShort
source: Password must be at least 6 characters.
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل.
he: הסיסמה חייבת להכיל לפחות 6 תווים.
ru: Пароль должен быть не короче 6 символов.

# account.familyNamePlaceholder
source: Family name (optional)
ar: اسم العائلة (اختياري)
he: שם משפחה (לא חובה)
ru: Фамилия (необязательно)

# account.forgotPassword
source: Forgot password?
ar: نسيت كلمة المرور؟
he: שכחת סיסמה?
ru: Забыли пароль?

# account.memberSince
source: Member since %@
ar: عضو منذ %@
he: חבר מאז %@
ru: С нами с %@

# account.memberSinceLabel
source: Member since
ar: عضو منذ
he: חבר מאז
ru: С нами с

# account.namePlaceholder
source: Name
ar: الاسم
he: שם פרטי
ru: Имя

# account.newPassword
source: New Password
ar: كلمة المرور الجديدة
he: סיסמה חדשה
ru: Новый пароль

# account.passwordChanged
source: Password updated successfully
ar: تم تحديث كلمة المرور بنجاح
he: הסיסמה עודכנה בהצלחה
ru: Пароль изменён

# account.passwordHint
source: At least 6 characters, letters and/or numbers.
ar: على الأقل 6 أحرف أو أرقام أو كليهما.
he: לפחות 6 תווים, אותיות ו/או מספרים.
ru: Не меньше 6 символов: буквы и/или цифры.

# account.passwordMismatch
source: Passwords don't match
ar: كلمتا المرور غير متطابقتين
he: הסיסמאות אינן תואמות
ru: Пароли не совпадают

# account.passwordPlaceholder
source: Password
ar: كلمة المرور
he: סיסמה
ru: Пароль

# account.passwordRule
source: At least 6 characters.
ar: 6 أحرف على الأقل.
he: לפחות 6 תווים.
ru: Не меньше 6 символов.

# account.profileSection
source: Profile
ar: الملف الشخصي
he: פרופיל
ru: Профиль

# account.resendCode
source: Resend code
ar: إعادة إرسال الرمز
he: שלח קוד שוב
ru: Отправить код ещё раз

# account.resendSent
source: Code resent
ar: تم إعادة إرسال الرمز
he: הקוד נשלח שוב
ru: Код отправлен повторно

# account.resetHint
source: Enter your email and we'll send you a code to reset your password.
ar: أدخل بريدك الإلكتروني وسنرسل لك رمزًا لإعادة تعيين كلمة المرور.
he: הזן את כתובת האימייל שלך ונשלח לך קוד לאיפוס הסיסמה.
ru: Введите свою эл. почту — мы пришлём код для сброса пароля.

# account.resetSubmitButton
source: Reset Password
ar: إعادة تعيين كلمة المرور
he: אפס סיסמה
ru: Сбросить пароль

# account.resetTitle
source: Reset Password
ar: إعادة تعيين كلمة المرور
he: איפוס סיסמה
ru: Сброс пароля

# account.restoreSuccess
source: Your data has been restored
ar: تمت استعادة بياناتك
he: הנתונים שלך שוחזרו
ru: Ваши данные восстановлены

# account.section
source: Account
ar: الحساب
he: חשבון
ru: Аккаунт

# account.securitySection
source: Security
ar: الأمان
he: אבטחה
ru: Безопасность

# account.sendCodeButton
source: Send Code
ar: إرسال الرمز
he: שלח קוד
ru: Отправить код

# account.signInButton
source: Sign In
ar: تسجيل الدخول
he: התחברות
ru: Войти

# account.signInTitle
source: Sign In
ar: تسجيل الدخول
he: התחברות
ru: Вход

# account.signOut
source: Sign Out
ar: تسجيل الخروج
he: התנתקות
ru: Выйти

# account.signUpTitle
source: Create Account
ar: إنشاء حساب
he: יצירת חשבון
ru: Создать аккаунт

# account.signedInAs %@
source: Signed in as %@
ar: مسجّل الدخول باسم %@
he: מחוברים כ-%@
ru: Вы вошли как %@

# account.signedOutHint
source: Create a free account so your shifts and settings survive a reinstall or a new phone.
ar: أنشئ حساباً مجانياً حتى تبقى ورديّاتك وإعداداتك محفوظة عند إعادة التثبيت أو تغيير الهاتف.
he: צרו חשבון חינמי כדי שהמשמרות וההגדרות שלכם ישרדו התקנה מחדש או טלפון חדש.
ru: Создайте бесплатный аккаунт, чтобы смены и настройки сохранились при переустановке или смене телефона.

# account.signedOutTitle
source: Keep your data safe
ar: حافظ على بياناتك آمنة
he: שמרו על הנתונים שלכם
ru: Сохраните свои данные

# account.syncBlockedEmptyOverwrite
source: Sync skipped — your account already has more data online than this device. Sign out and back in to restore it, then try again.
ar: تم تخطي المزامنة — يحتوي حسابك بالفعل على بيانات أكثر عبر الإنترنت مقارنة بهذا الجهاز. سجّل الخروج ثم أعد تسجيل الدخول لاستعادتها، ثم حاول مرة أخرى.
he: הסנכרון דולג — לחשבון שלך כבר יש יותר נתונים באינטרנט מאשר במכשיר הזה. התנתק והתחבר שוב כדי לשחזר אותם, ואז נסה שוב.
ru: Синхронизация пропущена: в аккаунте больше данных, чем на этом устройстве. Выйдите и войдите снова, чтобы их восстановить, затем попробуйте ещё раз.

# account.syncHint
source: Your settings and all tracked hours are backed up to your account.
ar: يتم نسخ إعداداتك وجميع سجلات ساعاتك احتياطياً في حسابك.
he: ההגדרות שלך וכל שעות העבודה שנרשמו מגובות בחשבון שלך.
ru: Ваши настройки и все записанные часы сохраняются в аккаунте.

# account.syncNow
source: Sync Now
ar: مزامنة الآن
he: סנכרן עכשיו
ru: Синхронизировать

# account.syncSection
source: Backup & Sync
ar: النسخ الاحتياطي والمزامنة
he: גיבוי וסנכרון
ru: Резервная копия и синхронизация

# account.syncSuccess
source: Synced to your account
ar: تمت المزامنة مع حسابك
he: סונכרן לחשבון שלך
ru: Синхронизировано с аккаунтом

# account.syncing
source: Syncing…
ar: جارٍ المزامنة…
he: מסנכרן…
ru: Синхронизация…

# account.verifiedBadge
source: Verified
ar: تم التحقق
he: מאומת
ru: Подтверждён

# account.verifyButton
source: Verify
ar: تحقق
he: אמת
ru: Подтвердить

# account.verifyHint %@
source: Enter the 8-digit code we sent to %@
ar: أدخل الرمز المكوّن من 8 أرقام الذي أرسلناه إلى %@
he: הזינו את קוד ה-8 הספרות ששלחנו אל %@
ru: Введите 8-значный код, который мы отправили на %@

# account.verifyTitle
source: Verify Your Email
ar: تحقق من بريدك الإلكتروني
he: אימות אימייל
ru: Подтвердите эл. почту

# account.welcomeSubtitle
source: Sign up to back up your shifts and settings, and get them back on any device.
ar: سجّل للنسخ الاحتياطي لورديّاتك وإعداداتك، واستعادتها على أي جهاز.
he: הירשמו כדי לגבות את המשמרות וההגדרות שלכם ולקבל אותם בחזרה בכל מכשיר.
ru: Зарегистрируйтесь, чтобы сохранить смены и настройки и открыть их на любом устройстве.

# account.welcomeTitle
source: Your Account
ar: حسابك
he: החשבון שלך
ru: Ваш аккаунт

# admin.announcements
source: Announcements
ar: الرسائل
he: הודעות
ru: Объявления

# admin.audience
source: Send to
ar: إبعت لـ
he: שליחה אל
ru: Кому отправить

# admin.audience.all
source: Everyone
ar: الكل
he: כולם
ru: Всем

# admin.audience.language
source: By app language
ar: حسب لغة التطبيق
he: לפי שפת האפליקציה
ru: По языку приложения

# admin.audience.users
source: Selected users
ar: مستخدمين محددين
he: משתמשים נבחרים
ru: Выбранным пользователям

# admin.audience.version
source: By app version
ar: حسب النسخة
he: לפי גרסה
ru: По версии приложения

# admin.audienceCount %1$@ %2$@
source: %1$@ devices · %2$@ can receive push
ar: %1$@ جهاز · %2$@ بيوصلهم إشعار
he: %1$@ מכשירים · %2$@ יכולים לקבל התראה
ru: Устройств: %1$@ · с push: %2$@

# admin.bodyField
source: Message text
ar: نص الرسالة
he: תוכן ההודעה
ru: Текст сообщения

# admin.compose
source: New announcement
ar: رسالة جديدة
he: הודעה חדשה
ru: Новое объявление

# admin.confirmMessage %@
source: %@ of them will also get a push notification. This can't be undone.
ar: %@ منهم رح يوصلهم كمان إشعار. ما بتقدر تتراجع.
he: %@ מהם יקבלו גם התראת Push. אי אפשר לבטל את זה.
ru: Из них %@ также получат push-уведомление. Отменить это нельзя.

# admin.confirmTitle %@
source: Send to %@ devices?
ar: تبعت لـ %@ جهاز؟
he: לשלוח ל-%@ מכשירים?
ru: Отправить на устройства: %@?

# admin.deliverInApp
source: Show inside the app
ar: عرض داخل التطبيق
he: הצגה בתוך האפליקציה
ru: Показать в приложении

# admin.deliverPush
source: Push notification
ar: إشعار Push
he: התראת Push
ru: Push-уведомление

# admin.delivery
source: Delivery
ar: طريقة التوصيل
he: אופן המשלוח
ru: Доставка

# admin.emailsField
source: Account emails, separated by commas
ar: إيميلات الحسابات، مفصولة بفواصل
he: כתובות מייל של חשבונות, מופרדות בפסיקים
ru: Эл. почта аккаунтов через запятую

# admin.error.forbidden
source: This account isn't an admin.
ar: هاد الحساب مش مدير.
he: החשבון הזה אינו מנהל.
ru: Этот аккаунт не администратор.

# admin.error.notSignedIn
source: Sign in to your account first.
ar: سجّل دخول لحسابك أول.
he: יש להתחבר לחשבון קודם.
ru: Сначала войдите в аккаунт.

# admin.error.rateLimited
source: Too many sends — try again in an hour.
ar: بعتت كتير — جرّب كمان ساعة.
he: יותר מדי שליחות — נסו שוב בעוד שעה.
ru: Слишком много отправок — попробуйте через час.

# admin.error.server %@
source: Server error (%@). Try again.
ar: خطأ بالسيرفر (%@). جرّب كمان مرة.
he: שגיאת שרת (%@). נסו שוב.
ru: Ошибка сервера (%@). Попробуйте ещё раз.

# admin.history
source: Sent announcements
ar: الرسائل المبعوتة
he: הודעות שנשלחו
ru: Отправленные объявления

# admin.history.counts %1$@ %2$@ %3$@
source: %1$@ devices · %2$@ push · %3$@ seen in app
ar: %1$@ جهاز · %2$@ إشعار · %3$@ شافوها بالتطبيق
he: %1$@ מכשירים · %2$@ התראות · %3$@ ראו באפליקציה
ru: Устройств: %1$@ · push: %2$@ · прочитано в приложении: %3$@

# admin.history.empty
source: Nothing sent yet.
ar: لسا ما انبعت إشي.
he: עוד לא נשלח כלום.
ru: Пока ничего не отправлено.

# admin.language
source: Language
ar: اللغة
he: שפה
ru: Язык

# admin.message
source: Message
ar: الرسالة
he: ההודעה
ru: Сообщение

# admin.missingLanguages %@
source: No text yet for: %@ — those users will get the English (or another) version.
ar: لسا ما في نص لـ: %@ — هدول المستخدمين رح توصلهم النسخة الإنجليزية (أو غيرها).
he: אין עדיין טקסט ל: %@ — המשתמשים האלה יקבלו את הגרסה באנגלית (או אחרת).
ru: Нет текста для: %@ — эти пользователи получат английскую (или другую) версию.

# admin.noRecipients
source: No devices match this audience.
ar: ما في أجهزة بتطابق هالاختيار.
he: אין מכשירים שמתאימים לקהל הזה.
ru: Под эти условия не подходит ни одно устройство.

# admin.send
source: Send
ar: إبعت
he: שליחה
ru: Отправить

# admin.sentMessage %1$@ %2$@ %3$@
source: Reached %1$@ devices. Push: %2$@ delivered, %3$@ failed.
ar: وصلت لـ %1$@ جهاز. الإشعارات: %2$@ وصلت، %3$@ فشلت.
he: הגיע ל-%1$@ מכשירים. Push: %2$@ נמסרו, %3$@ נכשלו.
ru: Доставлено на устройства: %1$@. Push: доставлено %2$@, ошибок %3$@.

# admin.sentPushNotConfigured %@
source: Saved for %@ devices (shown in the app). Push isn't set up on the server yet.
ar: انحفظت لـ %@ جهاز (رح تنعرض بالتطبيق). الإشعارات لسا مش مجهزة على السيرفر.
he: נשמר עבור %@ מכשירים (יוצג באפליקציה). Push עדיין לא מוגדר בשרת.
ru: Сохранено для устройств: %@ (показ в приложении). Push на сервере ещё не настроен.

# admin.sentTitle
source: Sent
ar: انبعتت
he: נשלח
ru: Отправлено

# admin.settingsEntry
source: Owner dashboard
ar: لوحة تحكم المالك
he: לוח בקרה לבעלים
ru: Панель владельца

# admin.settingsFooter
source: Only you see this — your account is an admin on the server.
ar: إنت بس بتشوف هاد — حسابك معرّف كمدير على السيرفر.
he: רק את/ה רואה את זה — החשבון שלך מוגדר כמנהל בשרת.
ru: Это видите только вы — ваш аккаунт администратор на сервере.

# admin.stat.accounts
source: Accounts
ar: الحسابات
he: חשבונות
ru: Аккаунты

# admin.stat.active1d
source: Active today
ar: نشطين اليوم
he: פעילים היום
ru: Активны сегодня

# admin.stat.active30d
source: Active this month
ar: نشطين هالشهر
he: פעילים החודש
ru: Активны в этом месяце

# admin.stat.active7d
source: Active this week
ar: نشطين هالأسبوع
he: פעילים השבוע
ru: Активны на этой неделе

# admin.stat.devices
source: Devices
ar: الأجهزة
he: מכשירים
ru: Устройства

# admin.stat.languages
source: App language
ar: لغة التطبيق
he: שפת האפליקציה
ru: Язык приложения

# admin.stat.push
source: Can receive push
ar: بيوصلهم إشعارات
he: יכולים לקבל התראות
ru: Получают push

# admin.stat.versions
source: App version
ar: نسخة التطبيق
he: גרסת האפליקציה
ru: Версия приложения

# admin.stat.watch
source: With Apple Watch
ar: مع Apple Watch
he: עם Apple Watch
ru: С Apple Watch

# admin.stat.widget
source: Using a widget
ar: بيستخدموا ويدجت
he: משתמשים בווידג׳ט
ru: Используют виджет

# admin.stats
source: Usage (totals only)
ar: الاستخدام (أرقام إجمالية فقط)
he: שימוש (סיכומים בלבד)
ru: Использование (только итоги)

# admin.statsFooter
source: Counts only. No one's shifts, pay or personal details are ever shown here.
ar: أعداد فقط. ما بتنعرض هون ورديات أو رواتب أو تفاصيل شخصية لحدا.
he: ספירות בלבד. משמרות, שכר או פרטים אישיים של אף אחד לא מוצגים כאן.
ru: Только количества. Смены, зарплата и личные данные здесь никогда не показываются.

# admin.title
source: Admin
ar: الإدارة
he: ניהול
ru: Администратор

# admin.titleField
source: Title
ar: العنوان
he: כותרת
ru: Заголовок

# admin.translate %@
source: Translate from %@ to the other languages
ar: ترجم من %@ لباقي اللغات
he: תרגם מ%@ לשאר השפות
ru: Перевести с языка %@ на остальные

# admin.translateHint
source: Each user gets the version in their app language. Check the translation before sending.
ar: كل مستخدم بتوصله النسخة بلغة تطبيقه. راجع الترجمة قبل ما تبعت.
he: כל משתמש מקבל את הגרסה בשפת האפליקציה שלו. כדאי לבדוק את התרגום לפני השליחה.
ru: Каждый пользователь получит версию на языке своего приложения. Проверьте перевод перед отправкой.

# admin.translateNeedsKey
source: Add a Gemini key in Settings → Smart scanner to enable auto-translate. Each user gets the version in their app language.
ar: ضيف مفتاح Gemini بالإعدادات ← الماسح الذكي لتشغيل الترجمة التلقائية. كل مستخدم بتوصله النسخة بلغة تطبيقه.
he: הוסיפו מפתח Gemini בהגדרות ← סורק חכם כדי להפעיל תרגום אוטומטי. כל משתמש מקבל את הגרסה בשפת האפליקציה שלו.
ru: Добавьте ключ Gemini в Настройки → Умный сканер, чтобы включить автоперевод. Каждый пользователь получит версию на языке своего приложения.

# admin.unmatchedEmails %@
source: No account for: %@
ar: ما في حساب لـ: %@
he: אין חשבון עבור: %@
ru: Нет аккаунта для: %@

# admin.versionsField
source: Versions, e.g. 1.6, 1.7
ar: نسخ، مثلاً 1.6, 1.7
he: גרסאות, למשל 1.6, 1.7
ru: Версии, например 1.6, 1.7

# announcement.dismiss
source: Got it
ar: تمام
he: הבנתי
ru: Понятно

# announcement.header
source: From the HoursTracker team
ar: من فريق HoursTracker
he: מצוות HoursTracker
ru: От команды HoursTracker

# appLock.enabled
source: App Lock
ar: قفل التطبيق
he: נעילת אפליקציה
ru: Блокировка приложения

# appLock.failed
source: Authentication failed. Try again.
ar: فشلت المصادقة. حاول مرة أخرى.
he: האימות נכשל. נסו שוב.
ru: Не удалось подтвердить личность. Попробуйте ещё раз.

# appLock.hint
source: When on, Face ID, Touch ID, or your device passcode is required to open HoursTracker after launch or after 30 seconds in the background.
ar: عند التفعيل، يلزم Face ID أو Touch ID أو رمز الجهاز لفتح HoursTracker بعد التشغيل أو بعد 30 ثانية في الخلفية.
he: כשמופעל, נדרשים Face ID, Touch ID או קוד המכשיר כדי לפתוח את HoursTracker אחרי הפעלה או אחרי 30 שניות ברקע.
ru: Если включено, для открытия HoursTracker после запуска или через 30 секунд в фоне нужен Face ID, Touch ID или код-пароль устройства.

# appLock.reason
source: Unlock HoursTracker to view your work hours and personal information.
ar: افتح HoursTracker لعرض ساعات العمل ومعلوماتك الشخصية.
he: פתחו את HoursTracker כדי לצפות בשעות העבודה ובמידע האישי.
ru: Разблокируйте HoursTracker, чтобы увидеть рабочие часы и личные данные.

# appLock.section
source: Security
ar: الأمان
he: אבטחה
ru: Безопасность

# appLock.subtitle
source: Authenticate to view your hours and personal details.
ar: صادِق لعرض ساعاتك وتفاصيلك الشخصية.
he: אמתו זהות כדי לצפות בשעות ובפרטים האישיים.
ru: Подтвердите личность, чтобы увидеть часы и личные данные.

# appLock.title
source: HoursTracker is locked
ar: HoursTracker مقفل
he: HoursTracker נעולה
ru: HoursTracker заблокирован

# appLock.unavailable
source: Device authentication is unavailable. Set a passcode in iOS Settings.
ar: مصادقة الجهاز غير متاحة. عيّن رمز مرور في إعدادات iOS.
he: אימות המכשיר אינו זמין. הגדירו קוד גישה בהגדרות iOS.
ru: Проверка на устройстве недоступна. Задайте код-пароль в настройках iOS.

# appLock.unlock
source: Unlock
ar: فتح القفل
he: פתח
ru: Разблокировать

# assistant.clear
source: Clear chat
ar: مسح المحادثة
he: ניקוי השיחה
ru: Очистить чат

# assistant.daysOffHeadline %lld
source: %lld days with no shift.
ar: %lld يومًا بلا مناوبة.
he: %lld ימים ללא משמרת.
ru: Дней без смены: %lld.

# assistant.documentFailed
source: I couldn't build that file. Try the Export tab instead.
ar: تعذّر إنشاء الملف. جرّب تبويب التصدير بدلًا من ذلك.
he: לא הצלחתי לייצר את הקובץ. נסו את לשונית הייצוא.
ru: Не получилось создать файл. Попробуйте вкладку «Экспорт».

# assistant.documentReady
source: Your report is ready.
ar: تقريرك جاهز.
he: הדוח שלכם מוכן.
ru: Ваш отчёт готов.

# assistant.hoursHeadline %@ %lld
source: %@ across %lld days.
ar: %@ خلال %lld يومًا.
he: %@ ב-%lld ימים.
ru: %@ · дней: %lld.

# assistant.inputPlaceholder
source: Ask about your hours…
ar: اسأل عن ساعاتك…
he: שאלו על השעות שלכם…
ru: Спросите о своих часах…

# assistant.moreRows %lld
source: +%lld more — open History for the full list.
ar: و%lld أخرى — افتح السجل للقائمة الكاملة.
he: עוד %lld - פתחו את ההיסטוריה לרשימה המלאה.
ru: Ещё %lld — полный список в «Истории».

# assistant.networkError
source: I couldn't reach the service. Check your connection and try again.
ar: تعذّر الوصول إلى الخدمة. تحقّق من اتصالك وحاول مجددًا.
he: לא הצלחתי להתחבר לשירות. בדקו את החיבור ונסו שוב.
ru: Не удалось связаться с сервисом. Проверьте подключение и попробуйте ещё раз.

# assistant.noData
source: No shifts match that.
ar: لا توجد مناوبات مطابقة.
he: אין משמרות שתואמות לכך.
ru: Подходящих смен нет.
